results/20260909-qwen38-dflash2-rtn-standard/bf16-clients/vllm-bench/c1.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f20a1860900>, trust_remote_code=False, seed=42, num_prompts=48, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='qwen38', input_len=512, output_len=128, tokenizer='/model', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=3, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/profile/vllm-bench', result_filename='c1.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='25,50,75,90,99', goodput=None, request_id_prefix='bench-e528e260-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-09 15:14:57 [utils.py:90] Sampling input_len from [512, 512] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 3 requests...
100%|██████████| 3/3 [00:06<00:00,  2.07s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 48/48 [01:37<00:00,  2.03s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     48        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  97.53     
Total input tokens:                      24576     
Total generated tokens:                  6144      
Request throughput (req/s):              0.49      
Output token throughput (tok/s):         63.00     
Peak output token throughput (tok/s):    21.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          314.99    
---------------Time to First Token----------------
Mean TTFT (ms):                          298.63    
Median TTFT (ms):                        306.71    
P25 TTFT (ms):                           306.40    
P50 TTFT (ms):                           306.71    
P75 TTFT (ms):                           306.86    
P90 TTFT (ms):                           306.96    
P99 TTFT (ms):                           307.23    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.65     
Median TPOT (ms):                        11.61     
P25 TPOT (ms):                           8.13      
P50 TPOT (ms):                           11.61     
P75 TPOT (ms):                           18.85     
P90 TPOT (ms):                           23.11     
P99 TPOT (ms):                           27.05     
---------------Inter-token Latency----------------
Mean ITL (ms):                           49.11     
Median ITL (ms):                         49.09     
P25 ITL (ms):                            49.00     
P50 ITL (ms):                            49.09     
P75 ITL (ms):                            49.21     
P90 ITL (ms):                            49.43     
P99 ITL (ms):                            49.99     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          2031.67   
Median E2EL (ms):                        1762.66   
P25 E2EL (ms):                           1339.72   
P50 E2EL (ms):                           1762.66   
P75 E2EL (ms):                           2692.93   
P90 E2EL (ms):                           3203.53   
P99 E2EL (ms):                           3741.75   
---------------Speculative Decoding---------------
Acceptance rate (%):                     38.28     
Acceptance length:                       3.68      
Drafts:                                  1694      
Draft tokens:                            11858     
Accepted tokens:                         4539      
Per-position acceptance (%):
  Position 0:                            67.83     
  Position 1:                            47.93     
  Position 2:                            39.67     
  Position 3:                            31.29     
  Position 4:                            28.87     
  Position 5:                            26.86     
  Position 6:                            25.50     
==================================================