results/20260909-qwen38-dflash2-rtn-standard/bf16-clients/vllm-bench/c2.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7ff077511080>, trust_remote_code=False, seed=42, num_prompts=48, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=2, model='qwen38', input_len=512, output_len=128, tokenizer='/model', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=3, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/profile/vllm-bench', result_filename='c2.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='25,50,75,90,99', goodput=None, request_id_prefix='bench-29240f70-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-09 15:16:49 [utils.py:90] Sampling input_len from [512, 512] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 3 requests...
100%|██████████| 3/3 [00:06<00:00,  2.01s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 2
100%|██████████| 48/48 [01:39<00:00,  2.07s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     48        
Failed requests:                         0         
Maximum request concurrency:             2         
Benchmark duration (s):                  99.12     
Total input tokens:                      24576     
Total generated tokens:                  6144      
Request throughput (req/s):              0.48      
Output token throughput (tok/s):         61.98     
Peak output token throughput (tok/s):    21.00     
Peak concurrent requests:                3.00      
Total token throughput (tok/s):          309.92    
---------------Time to First Token----------------
Mean TTFT (ms):                          2315.47   
Median TTFT (ms):                        2061.54   
P25 TTFT (ms):                           1638.45   
P50 TTFT (ms):                           2061.54   
P75 TTFT (ms):                           3078.63   
P90 TTFT (ms):                           3479.89   
P99 TTFT (ms):                           4108.49   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.93     
Median TPOT (ms):                        12.57     
P25 TPOT (ms):                           8.14      
P50 TPOT (ms):                           12.57     
P75 TPOT (ms):                           19.69     
P90 TPOT (ms):                           23.13     
P99 TPOT (ms):                           27.58     
---------------Inter-token Latency----------------
Mean ITL (ms):                           49.12     
Median ITL (ms):                         49.09     
P25 ITL (ms):                            48.99     
P50 ITL (ms):                            49.09     
P75 ITL (ms):                            49.22     
P90 ITL (ms):                            49.45     
P99 ITL (ms):                            50.01     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          4084.66   
Median E2EL (ms):                        4143.07   
P25 E2EL (ms):                           3084.67   
P50 E2EL (ms):                           4143.07   
P75 E2EL (ms):                           4807.35   
P90 E2EL (ms):                           5543.21   
P99 E2EL (ms):                           6913.33   
---------------Speculative Decoding---------------
Acceptance rate (%):                     37.16     
Acceptance length:                       3.60      
Drafts:                                  1729      
Draft tokens:                            12103     
Accepted tokens:                         4498      
Per-position acceptance (%):
  Position 0:                            67.32     
  Position 1:                            47.02     
  Position 2:                            38.52     
  Position 3:                            30.13     
  Position 4:                            27.53     
  Position 5:                            25.51     
  Position 6:                            24.12     
==================================================